package client_robot

import (
	"fmt"
	"go_game_server/proto3"
	"go_game_server/server/util"
	"math/big"
	"math/rand"
	"net"
	"strings"
	"time"
)

func InetAtoN(ip string) int64 {
	ret := big.NewInt(0)
	ret.SetBytes(net.ParseIP(ip).To4())
	return ret.Int64()
}

func getName(i int) string {
	info, _ := net.InterfaceAddrs()
	fmt.Println("------------ ip address", info)
	ipStr := info[1].String()
	ip := strings.Split(ipStr, "/")
	acctName := RobotInfo.Name + util.ToInt64Str(InetAtoN(ip[0])+util.MilliTime()+int64(i))
	return acctName
}

func (c *ClientRobot) sendMsg(cmd proto3.ProtoCmd, pbData interface{}) {
	c.MsgList = append(c.MsgList, robotData{Cmd: cmd, PbData: pbData})
}

//---------------------------------------- 机器人模拟发协议 ------------------------------------------

// 请求登录
func (c *ClientRobot) robotLogin(i int) {
	// cmd := proto3.ProtoCmd_CMD_LoginReq
	// acctName := getName(i)
	// pbData := &proto3.LoginReq{AcctName: acctName, BigVersion: 9999, SmallVersion: 9999}
	// c.LordName = acctName
	// fmt.Println("---------------------login ", c.LordName)
	// c.sendMsg(cmd, pbData)
}

// 开始跑操作
func (c *ClientRobot) robotRun() {
	c.heartBeat()
}

func (c *ClientRobot) heartBeat() {
	cmd := proto3.ProtoCmd_CMD_HeartBeatReq
	pbData := &proto3.HeartBeatReq{}
	c.sendMsg(cmd, pbData)
	timeNum := util.RandInt(20, 40)
	time.AfterFunc(time.Duration(timeNum)*time.Second, func() {
		c.heartBeat()
	})
}

func LandToXy(landID int32) (x int32, y int32) {
	x = landID % 1300
	y = landID / 1300
	return
}

func XyToLand(x int32, y int32) int32 {
	return x + 1300*y
}

func getAttackIndex(curIndex, birthIndex int32) int32 {
	if curIndex == 0 { // 出身点
		x, y := LandToXy(birthIndex)
		upPoint := XyToLand(x, y-4)
		downPoint := XyToLand(x, y+4)
		leftPoint := XyToLand(x-2, y)
		rightPoint := XyToLand(x+2, y)
		pointList := []int32{upPoint, downPoint, leftPoint, rightPoint}
		num := rand.Intn(len(pointList))
		return pointList[num]
	} else {
		x, y := LandToXy(curIndex)
		upPoint := XyToLand(x, y-2)
		downPoint := XyToLand(x, y+2)
		leftPoint := XyToLand(x-1, y)
		rightPoint := XyToLand(x+1, y)
		pointList := []int32{upPoint, downPoint, leftPoint, rightPoint}
		num := rand.Intn(len(pointList))
		return pointList[num]
	}
}

// 先起名字
func (c *ClientRobot) createName() {
	// cmd := proto3.ProtoCmd_CMD_CreateNameReq
	// lordName := getLordName()
	// c.LordName = lordName
	// pbData1 := &proto3.CreateNameReq{LordName: lordName}
	// c.sendMsg(cmd, pbData1)
}

// 再选国家
func (c *ClientRobot) createCountry() {
	// cmd := proto3.ProtoCmd_CMD_CreateCountryReq
	// pbData := &proto3.CreateCountryReq{CountryID: RobotInfo.Country} // TODO 随机选国家
	// c.sendMsg(cmd, pbData)
}

func getLordName() string {
	rand.Seed(time.Now().UnixNano())
	firstNameList := []string{"秦", "公", "石", "西门", "李", "牛", "刘", "吴", "楚", "诸葛", "爵", "绝", "东方", "荀", "孙", "木", "洪", "苏", "第一", "第二", "段", "曹", "魏", "南宫", "北辰", "紫川", "完颜", "夏侯", "武", "公孙", "王", "全", "金", "时", "史", "龙", "耶律", "楚", "齐", "步", "赢", "宁", "赵", "钱", "孙", "周", "吴", "郑", "张", "陈", "杨", "黄", "徐", "孙", "胡", "朱", "高", "林", "何", "郭", "马", "罗", "梁", "宋", "谢", "韩", "唐", "冯", "于", "董", "萧", "程", "曹", "袁", "邓", "许", "傅", "沈", "曾", "彭", "吕", "卢", "蒋", "蔡", "贾", "丁", "薛", "叶", "阎", "余", "潘", "杜", "戴", "夏", "钟", "汪", "田", "任", "姜", "范", "方", "石", "姚", "谭", "廖", "邹", "熊", "金", "陆", "郝", "孔", "白", "崔", "康", "毛", "邱", "秦", "江", "史", "顾", "侯", "邵", "孟", "龙", "万", "段", "雷", "钱", "汤", "尹", "黎", "易", "常", "武", "乔", "贺", "赖", "龚", "文", "庞", "樊", "兰", "殷", "施", "陶", "洪", "翟", "安", "颜", "倪", "严", "牛", "温", "芦", "季", "俞", "章", "鲁", "葛", "伍", "韦", "申", "尤", "毕", "聂", "丛", "焦", "向", "柳", "邢", "路", "岳", "齐", "柴", "梅", "莫", "庄", "辛", "管", "祝", "左", "涂", "谷", "祁", "时", "舒", "耿", "牟", "卜", "路", "詹", "关", "苗", "凌", "费", "纪", "靳", "盛", "童", "欧", "甄", "项", "曲", "成", "游", "阳", "裴", "沿", "卫", "查", "屈", "鲍", "位", "覃", "霍", "翁", "隋", "植", "甘", "景", "薄", "单", "包", "司", "柏", "宁", "柯", "阮", "桂", "闵", "解", "强", "席", "华", "车", "冉", "房", "边"}
	middleNameList := []string{"雪", "春", "夏", "秋", "冬", "破", "寒", "败", "千", "处", "翠", "莫", "重", "长", "红", "语", "矫", "子", "续", "秀", "宁", "娇", "乔", "巧", "紫", "风", "振", "驰", "曼", "明", "名", "鸣", "铭", "其", "琪", "敏", "宇", "豪", "浩", "昊", "安", "黯", "烟", "言", "研", "严", "炎", "燕", "艳", "耀", "遥", "月", "阳", "凝", "冰", "云", "韵", "侠", "义", "天", "情", "青", "彧", "水", "柔", "书", "杰", "一", "子", "风", "凤", "愁", "焉", "川", "锋", "牙", "雄", "寒", "涵", "晗", "珍", "光", "夜", "政", "捷", "婕", "羽", "玉", "霜", "轩", "炫", "玄", "宣", "萱", "璇", "绚", "纯", "淳", "汉", "乾", "谦", "倩", "茜", "萃", "末", "墨", "摩", "默", "冲", "崇", "忠", "仲", "衷", "常", "昌", "雨", "宇", "裕", "瑜", "誉", "虚", "叙", "序", "旭", "绪", "絮", "诩", "修", "休", "绣", "凝", "俏", "梓", "封", "锋", "峰", "丰", "奉", "枫", "正", "政", "徵", "铮", "征", "震", "镇", "轸", "贞", "弛", "蔓", "越", "珉", "岳", "仰", "望", "旺", "芸", "允", "昀", "兰", "蓝", "岚", "澜", "朗", "琅", "尚", "善", "珊", "杉", "仁", "晓", "萧", "孝", "啸", "霄", "筱", "幽", "优", "忧", "悠", "佑", "纹", "雯", "静", "镜", "菁", "璟", "京", "景", "敬", "晶", "靖", "婧", "庆", "卿", "桑", "琳", "临", "霖", "凌", "灵", "玲", "铃", "英", "瑛", "缨", "盈", "颖", "莹", "樱", "萤", "莺", "志", "智", "沐", "坤", "昆", "琨", "永", "勇", "咏", "成", "诚", "城", "程", "呈", "承", "澄", "骋", "升", "胜", "圣", "盛", "晟", "笙", "堂", "樘", "棠", "宗", "聪", "从", "丛", "琮", "久", "玖", "全", "权", "泉", "此", "词", "慈", "新", "心", "信", "辛", "鑫", "芯", "馨", "昕", "忻", "星", "杏", "欢", "焕", "恒", "衡", "郃", "航", "杭", "平", "萍", "屏", "普", "溥", "祎", "宜", "亦", "易", "依", "翼", "伊", "亚", "雅", "娅", "芽", "彦", "加", "家", "佳", "嘉", "贤", "显", "献", "弦", "娴", "楠", "男", "南", "萌", "猛", "梦", "蒙", "逊", "迅", "勋", "群", "仪", "贝", "备", "奔", "宝", "保", "葆", "苞", "班", "展", "虎", "护", "汇", "徽", "辉", "惠", "慧", "晖", "悔", "蕙", "舟", "州", "洲", "宙", "瑞", "锐", "睿", "蕊", "芮", "叡", "艺", "理", "力", "离", "利", "立", "黎", "丽", "礼", "历", "莉", "厉", "励", "如", "茹", "儒", "则", "泽", "哲", "照", "兆", "召", "昭", "诏", "钊", "朝", "双", "姝", "术", "舒", "顺", "苏", "速", "素", "肃"}
	lastNameList := []string{"侠", "义", "天", "情", "青", "彧", "水", "柔", "书", "杰", "一", "子", "风", "凤", "愁", "阳", "焉", "川", "锋", "牙", "雄", "寒", "涵", "晗", "珍", "光", "夜", "政", "捷", "婕", "羽", "玉", "霜", "雪", "春", "夏", "秋", "冬", "破", "千", "处", "翠", "莫", "重", "长", "红", "语", "矫", "子", "续", "秀", "宁", "娇", "乔", "巧", "紫", "风", "振", "驰", "曼", "明", "名", "鸣", "铭", "其", "琪", "敏", "宇", "豪", "浩", "昊", "安", "黯", "烟", "言", "研", "严", "炎", "燕", "艳", "耀", "遥", "月", "阳", "凝", "冰", "云", "韵", "霜", "轩", "炫", "玄", "宣", "萱", "璇", "绚", "纯", "淳", "汉", "乾", "谦", "倩", "茜", "萃", "末", "墨", "摩", "默", "冲", "崇", "忠", "仲", "衷", "常", "昌", "雨", "宇", "裕", "瑜", "誉", "虚", "叙", "序", "旭", "绪", "絮", "诩", "修", "休", "绣", "凝", "俏", "梓", "封", "锋", "峰", "丰", "奉", "枫", "正", "政", "徵", "铮", "征", "震", "镇", "轸", "贞", "弛", "蔓", "越", "珉", "岳", "仰", "望", "旺", "芸", "允", "昀", "兰", "蓝", "岚", "澜", "朗", "琅", "尚", "善", "珊", "杉", "仁", "晓", "萧", "孝", "啸", "霄", "筱", "幽", "优", "忧", "悠", "佑", "纹", "雯", "静", "镜", "菁", "璟", "京", "景", "敬", "晶", "靖", "婧", "庆", "卿", "桑", "琳", "临", "霖", "凌", "灵", "玲", "铃", "英", "瑛", "缨", "盈", "颖", "莹", "樱", "萤", "莺", "志", "智", "沐", "坤", "昆", "琨", "永", "勇", "咏", "成", "诚", "城", "程", "呈", "承", "澄", "骋", "升", "胜", "圣", "盛", "晟", "笙", "堂", "樘", "棠", "宗", "聪", "从", "丛", "琮", "久", "玖", "全", "权", "泉", "此", "词", "慈", "新", "心", "信", "辛", "鑫", "芯", "馨", "昕", "忻", "星", "杏", "欢", "焕", "恒", "衡", "郃", "航", "杭", "平", "萍", "屏", "普", "溥", "祎", "宜", "亦", "易", "依", "翼", "伊", "亚", "雅", "娅", "芽", "彦", "加", "家", "佳", "嘉", "贤", "显", "献", "弦", "娴", "楠", "男", "南", "萌", "猛", "梦", "蒙", "逊", "迅", "勋", "群", "仪", "贝", "备", "奔", "宝", "保", "葆", "苞", "班", "展", "虎", "护", "汇", "徽", "辉", "惠", "慧", "晖", "悔", "蕙", "舟", "州", "洲", "宙", "瑞", "锐", "睿", "蕊", "芮", "叡", "艺", "理", "力", "离", "利", "立", "黎", "丽", "礼", "历", "莉", "厉", "励", "如", "茹", "儒", "则", "泽", "哲", "照", "兆", "召", "昭", "诏", "钊", "朝", "双", "姝", "术", "舒", "顺", "苏", "速", "素", "肃"}
	firstName := firstNameList[rand.Intn(len(firstNameList))]
	middleName := middleNameList[rand.Intn(len(middleNameList))]
	lastName := lastNameList[rand.Intn(len(lastNameList))]
	return firstName + middleName + lastName
}
